#1.Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

# a = input('Введите вещественное число: ')
# sum = 0
# for i in a:
#     if i != '.':
#         sum += int(i)
# print(sum)

#2.Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

# N = int(input('Введите число: '))
# i = 1
# result=1
# while (i <= N):
#     result *= i
#     i=i+1
#     print(result)
